dotfiles/index.html
<!-- Generated from 99fdb8c on 2023-12-23 @ 19:48 with Emacs 27.1 (Org mode 9.3) -->
<!DOCTYPE html><html lang="en"><head><meta charset="utf-8"/><meta author="J. Dylan White"/><meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no"/><link rel="stylesheet" href="https://jdylanwhite.github.io/css/code.css"/><link rel="stylesheet" href="https://jdylanwhite.github.io/css/site.css"/><title>Dotfiles - J. Dylan White</title></head><body><header class="site-header"><div class="container"><div class="site-title"><a class="site-name" href="/">J. Dylan White</a> </div></div><div class="site-masthead"><div class="container"><nav class="nav"><a class="nav-link" href="/">Home</a> <a class="nav-link" href="/projects/">Projects</a> <a class="nav-link" href="/dotfiles/">Dotfiles</a> </nav></div></div></header><div class="container"><div class="site-post"><h1 class="site-post-title">Dotfiles</h1><p class="site-post-meta"></p><div id="content">
<h2><a id="my-dotfiles" class="anchor" href="#my-dotfiles">¶</a>My Dotfiles</h2><div class="outline-text-2" id="text-orgdfec98b">
<p>
As I build out my various configuration files for my workflow and preferences, I do so using <a href="https://en.wikipedia.org/wiki/Literate_programming">literate programming</a> to build a literate configuration file using <a href="https://orgmode.org/">Org Mode</a> in <a href="https://www.gnu.org/software/emacs/">Emacs</a>. Since the configuration file is tied closely to my personal projects and how I work, I wanted to share them here on my site.
</p>

<p>
Currently, I am split in a few different directions. I am using my own personally configured vanilla Emacs and <a href="https://github.com/doomemacs/doomemacs">Doom Emacs</a>. Ideally, I&rsquo;d like to only use my own personally configured vanilla Emacs. Eventually I plan to get there, but for now I&rsquo;m just trying to use whatever will get the job done the quickest. Here are my current active dotfiles:
</p>

<ul class="org-ul">
<li><a href="emacs.html">My Emacs Configuration</a></li>
<li><a href="./doom-emacs.html">Doom Emacs Configuration</a></li>
</ul>

<p>
I also keep my configuration files in a <a href="https://github.com/jdylanwhite/dotfiles">GitHub repository</a>.
</p>
</div>
</div></div></div><footer class="site-footer"><div class="container"><div class="row"><div class="column"><p><a href="https://github.com/jdylanwhite">GitHub</a> · <a href="https://www.linkedin.com/in/jdylanwhite5">LinkedIn</a> · <a href="mailto:jdylanwhite5@gmail.com">Email</a></p></div><div class="column align-right"><p><a href="https://github.com/jdylanwhite/jdylanwhite.github.io">Site Source</a></p></div></div></div></footer></body></html>
